In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Company':['Google','Google','TCS','FB','FB'],
       'Person':['Sam','Charlie','Kala','Amy','Winky'],
       'Sales':[150,200,345,124,234]
       }

In [5]:
data = pd.DataFrame(data)
data

  Company   Person  Sales
0  Google      Sam    150
1  Google  Charlie    200
2     TCS     Kala    345
3      FB      Amy    124
4      FB    Winky    234

In [7]:
df = data.groupby('Company')
df

In [8]:
df.mean()

         Sales
Company
FB         179
Google     175
TCS        345

In [9]:
df.sum()

         Sales
Company
FB         358
Google     350
TCS        345

In [10]:
df.std()

             Sales
Company
FB       77.781746
Google   35.355339
TCS            NaN

In [11]:
df.sum().loc['FB']

Sales    358
Name: FB, dtype: int64

In [12]:
data.groupby('Company').sum().loc['Google']

Sales    350
Name: Google, dtype: int64

In [13]:
data.groupby('Company').count()

         Person  Sales
Company
FB            2      2
Google        2      2
TCS           1      1

In [15]:
data.groupby('Company').describe().transpose()

Company              FB      Google    TCS
Sales count    2.000000    2.000000    1.0
      mean   179.000000  175.000000  345.0
      std     77.781746   35.355339    NaN
      min    124.000000  150.000000  345.0
      25%    151.500000  162.500000  345.0
      50%    179.000000  175.000000  345.0
      75%    206.500000  187.500000  345.0
      max    234.000000  200.000000  345.0

In [16]:
#For caoncatenation => pd.concat([df1,df2,df3])

In [17]:
#For Merging => pd.merge(df1,df2,how='inner',on='column_name')

In [18]:
#Joining => The key will be your index.
#df.join(df1, how='inner/outer')

In [25]:
data = {
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','jkl']       
}

df = pd.DataFrame(data)
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  jkl

In [26]:
df['col2'].unique()

array([444, 555, 666])

In [27]:
df['col2'].nunique()

3

In [28]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [29]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  jkl

In [30]:
def times2(x):
    return x*2

In [31]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [32]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [34]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  jkl

In [35]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [36]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [38]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  jkl
1     2   555  def
2     3   666  ghi

In [39]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False